
## :white_check_mark: Apply Succeeded (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/75773)



<pre><code>Apply complete! Resources: 5 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
null_resource.user-registration: Refreshing state... [id=5327083105882550525]
null_resource.user-api-events: Refreshing state... [id=8253668488401468656]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue_36538BB9: Reading...
aws_sns_topic.list-api-events_list-event-topic_8792A1B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic]
aws_sqs_queue.user-registration_sns-topic-dql_811A5411: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ]
data.aws_sqs_queue.prospect-events_prospect-Prod-dlq_CF630359: Reading...
aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic]
aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60: Refreshing state... [id=queue-check-delete/PocketEventBus]
aws_sns_topic.user-registration_user-registration-topic_1A7AE012: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic]
aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic]
data.aws_sqs_queue.prospect-events_prospect-Prod-dlq_CF630359: Read complete after 1s [id=https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue-Deadletter]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue_36538BB9: Read complete after 1s [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue]
data.aws_caller_identity.all-events_caller_20BD1C35: Reading...
aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ]
aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419: Refreshing state... [id=Premium-Renewal-Upcoming/PocketEventBus]
aws_sns_topic.collection-events_collection-event-topic_343F754D: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic]
data.aws_caller_identity.all-events_caller_20BD1C35: Read complete after 0s [id=996905175585]
aws_sns_topic.user-api-events_user-event-topic_BF85AC87: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic]
aws_sns_topic.adm-events_user-merge-topic_59FD8EDC: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic]
aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B: Refreshing state... [id=user-merge/PocketEventBus]
data.aws_region.all-events_region_F90A933E: Reading...
data.aws_region.all-events_region_F90A933E: Read complete after 0s [id=us-east-1]
aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ]
aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical]
aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue-dlq_C3DDC925: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue-dlq_C3DDC925: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter]
aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-PremiumPurchase-Rule-Rule]
aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3: Refreshing state... [id=User-Registration-Event/PocketEventBus]
aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227: Refreshing state... [id=PocketEventBridge-Prod-EventTracker-Rule-Rule]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical]
aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic]
aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33: Refreshing state... [id=user-events/PocketEventBus]
aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59: Refreshing state... [id=Premium-Purchase/PocketEventBus]
aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus]
aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserRegistration-Rule-Rule]
aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic]
aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserMerge-Rule-Rule]
data.aws_sqs_queue.prospect-events_prospect-Prod-queue_79FEB8DA: Reading...
aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D: Refreshing state... [id=Forgot-Password-Request/PocketEventBus]
data.aws_iam_policy_document.user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED: Reading...
data.aws_iam_policy_document.user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED: Read complete after 0s [id=509125882]
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664: Reading...
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664: Read complete after 0s [id=308215119]
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F: Read complete after 0s [id=3384957766]
data.aws_iam_policy_document.all-events_PocketEventBridge-Prod-EventBridge-Cloudwatch-Policy_E97F83EF: Reading...
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F: Read complete after 0s [id=1040146387]
data.aws_sqs_queue.prospect-events_prospect-Prod-queue_79FEB8DA: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue]
data.aws_iam_policy_document.adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795: Reading...
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B: Reading...
data.aws_iam_policy_document.all-events_PocketEventBridge-Prod-EventBridge-Cloudwatch-Policy_E97F83EF: Read complete after 0s [id=1738596912]
data.aws_iam_policy_document.collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56: Reading...
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-EventTracker-Rule-Target_AF1CF51A: Refreshing state... [id=PocketEventBridge-Prod-EventTracker-Rule-Rule-AccountDeleteMonitor-Prod-EventTracker-Rule-Target]
aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D: Refreshing state... [id=PocketEventBridge-Prod-CollectionEvents-Rule-dlq-alarm]
aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-PremiumPurchase-SNS-Target_A8F33A09: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-PremiumPurchase-Rule-Rule-PocketEventBridge-Prod-PremiumPurchase-SNS-Target]
data.aws_iam_policy_document.adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795: Read complete after 0s [id=2151299890]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B: Read complete after 0s [id=2945242189]
data.aws_iam_policy_document.collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56: Read complete after 0s [id=209579824]
aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA: Refreshing state... [id=PocketEventBridge-Prod-PocketEventBridge-Prod-Dlq-Alarm]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446: Reading...
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Refreshing state... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78: Refreshing state... [id=PocketEventBridge-Prod-UserEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446: Read complete after 0s [id=144708017]
aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2: Refreshing state... [id=PocketEventBridge-Prod-PremiumPurchase-rule-dlq-alarm]
null_resource.premium-purchase_null-resource_E2C3B0AC: Refreshing state... [id=8590974618707730681]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Refreshing state... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120: Refreshing state... [id=PocketEventBridge-Prod-ProspectEvents-Rule-DLQ-Alarm]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PH8FGF4]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PDZUG2E]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
null_resource.user-registration_null-resource_B04CACC3: Refreshing state... [id=1347031598725150988]
aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic]
aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic]
aws_cloudwatch_event_target.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Registration-Event-SNS-Target_D5B6ADE6: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserRegistration-Rule-Rule-PocketEventBridge-Prod-User-Registration-Event-SNS-Target]
aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic]
aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ListApiEvents-Rule-Rule]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule]
aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic]
aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListEvents-Rule-Rule]
aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule]
aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-CollectionEvents-Rule-Rule]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ProspectEvents-Rule-Rule]
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserEvents-Rule-Rule]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-Prospect-Event-SQS-Policy_78EDEA17: Reading...
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-Prospect-Event-SQS-Policy_78EDEA17: Read complete after 0s [id=245579235]
aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F: Refreshing state... [id=PocketEventBridge-Prod-ListApiEvents-Rule-dlq-alarm]
aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic]
aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic]
aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic]
null_resource.adm-events_null-resource_C7D19F6F: Refreshing state... [id=5907751578904588335]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-UserMerge-Rule-Target_7DE5DC1D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserMerge-Rule-Rule-AccountDeleteMonitor-Prod-UserMerge-Rule-Target]
aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC: Reading...
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC: Read complete after 0s [id=2073910124]
null_resource.list-api-events_null-resource_D711C801: Refreshing state... [id=1177664838478028438]
aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-List-Event-SNS-Target_FD139C52: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ListApiEvents-Rule-Rule-PocketEventBridge-Prod-List-Event-SNS-Target]
aws_cloudwatch_event_target.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_C4E7E46F: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-CollectionEvents-Rule-Rule-PocketEventBridge-Prod-Collection-Event-SNS-Target]
null_resource.collection-events_null-resource_9F908E27: Refreshing state... [id=7083867980005228814]
null_resource.prospect-events_null-resource_BF542108: Refreshing state... [id=1286103112814733777]
aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target_D0F547B9: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SNS-Target_CC89DADA: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SNS-Target]
null_resource.shareable-list-events_null-resource_78AB9CC2: Refreshing state... [id=7244420153938391428]
aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue]
null_resource.shareable-list-item-events_null-resource_46056FE2: Refreshing state... [id=7377342030826013425]
null_resource.user-api-events_null-resource_C0C836FA: Refreshing state... [id=4119566737246291003]
aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target_84030FFD: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target]
aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Event-SNS-Target_9A50990C: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserEvents-Rule-Rule-PocketEventBridge-Prod-User-Event-SNS-Target]
aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target_C4F47897: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SQS-Target_649F5585: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SQS-Target]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 5s [id=PKAPG94]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PQHTY3G]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 5s [id=PZQ6AUS]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PN85XRT]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PUTEYG6]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P2MWVMD]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical:c6031a7a-308a-4840-a945-1551f5fe6974]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical:1e28704a-6e6f-4a9a-9e11-457f3af5f97f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD will be created
  + resource "aws_cloudwatch_event_rule" "all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + {
                      + exists = true
                    },
                ]
            }
        )
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-AllEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-All-Events-CloudWatch-Target_88D9BEC6 will be created
  + resource "aws_cloudwatch_event_target" "all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-All-Events-CloudWatch-Target_88D9BEC6" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Prod-AllEvents-Rule-Rule"
      + target_id      = "PocketEventBridge-Prod-All-Events-CloudWatch-Target"

      + dead_letter_config {}
    }

  # aws_cloudwatch_log_group.all-events_all-event-log-group_7F02C8C4 will be created
  + resource "aws_cloudwatch_log_group" "all-events_all-event-log-group_7F02C8C4" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/events/PocketEventBridge/AllEvents"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_resource_policy.all-events_all-events-cloudwatch-policy_AAF6FEAB will be created
  + resource "aws_cloudwatch_log_resource_policy" "all-events_all-events-cloudwatch-policy_AAF6FEAB" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "events.amazonaws.com",
                              + "delivery.logs.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:logs:us-east-1:996905175585:log-group:/aws/events/*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "PocketEventBridge-Prod-AllEvents-CloudwatchPolicy"
    }

  # aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3" {
      ~ dimensions                = {
          ~ "QueueName" = "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ" -> "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        }
        id                        = "PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # null_resource.all-events_null-resource_9E05AD52 will be created
  + resource "null_resource" "all-events_null-resource_9E05AD52" {
      + id = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
aws_cloudwatch_log_group.all-events_all-event-log-group_7F02C8C4: Creating...
aws_cloudwatch_log_resource_policy.all-events_all-events-cloudwatch-policy_AAF6FEAB: Creating...
aws_cloudwatch_event_rule.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD: Creating...
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Modifying... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_log_resource_policy.all-events_all-events-cloudwatch-policy_AAF6FEAB: Creation complete after 0s [id=PocketEventBridge-Prod-AllEvents-CloudwatchPolicy]
aws_cloudwatch_log_group.all-events_all-event-log-group_7F02C8C4: Creation complete after 0s [id=/aws/events/PocketEventBridge/AllEvents]
aws_cloudwatch_event_rule.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD: Creation complete after 0s [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-AllEvents-Rule-Rule]
null_resource.all-events_null-resource_9E05AD52: Creating...
null_resource.all-events_null-resource_9E05AD52: Creation complete after 0s [id=6208674952442905229]
aws_cloudwatch_event_target.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-All-Events-CloudWatch-Target_88D9BEC6: Creating...
aws_cloudwatch_event_target.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-All-Events-CloudWatch-Target_88D9BEC6: Creation complete after 0s [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-AllEvents-Rule-Rule-PocketEventBridge-Prod-All-Events-CloudWatch-Target]
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Modifications complete after 0s [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]

Apply complete! Resources: 5 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"da94c9b4-1b37-481b-a611-2560116146be","JobName":"pocket-event-bridge_infrastructure_apply_prod","PRNumber":263,"Program":"tfcmt","SHA1":"b1c2c35fbba7d326e61f2db06096873caff4df07","Target":"pocket-event-bridge-cdk","Vars":{}} -->